
/* All dialogs raised by the thermal manager will simply be notifications that the user can dismiss.  They will have a single button with the text "OK".  When the user clicks this button, the window will be dismissed.  This is the localizable button text. */
"OK_BUTTON"				= "OK";

/* The DEFLECTOR_* strings will be used when the Air Deflector is removed from the system chassis.  This message will be displayed in a dialog window to notify the user that he/she must replace the deflector or risk overheating. */

/* Dialog title */
"DEFLECTOR_TITLE"		= "Air Deflector Removed";

/* Dialog message text */
"DEFLECTOR_MSG"			= "The air deflector is not in place. Replace the air deflector immediately so the computer does not overheat and be forced into sleep mode.";

/* There is possible confusion of the name "air deflector" vs. "side panel" so here is a version of the same string, except using the phrase "side panel".  Only one of or the other of these variants will be used, but I'm putting both in here to avoid having to relocalize the text later. */

/* Dialog title */
"SIDEPANEL_TITLE"		= "Side Panel Removed";

/* Dialog message text */
"SIDEPANEL_MSG"			= "The side panel is not in place. Replace the side panel immediately so the computer does not overheat and be forced into sleep mode.";

/* The FANFAILED_* strings will be used when fan failure messages are displayed to the user. There is a different string for each fan in the system, and a generic string is included in case we don't with to specify which fan has failed.  The same title is used for every such dialog. */

/* Dialog title */
"FANFAILED_TITLE"		= "Fan Failure Detected";

/* A generic, self-contained fan failure message. */
"FANFAILED_GENERIC_MSG"	= "The computer has detected a fan failure. Take your computer to an Apple Authorized Repair Center for maintenance.";

/* fan-specific messages */
"FANFAILED_CPUAIN_MSG" = "The computer has detected a CPU A Intake Fan failure. Take your computer to an Apple Authorized Repair Center for maintenance.";

"FANFAILED_CPUAEX_MSG" = "The computer has detected a CPU A Exhaust Fan failure. Take your computer to an Apple Authorized Repair Center for maintenance.";

"FANFAILED_CPUBIN_MSG" = "The computer has detected a CPU B Intake Fan failure. Take your computer to an Apple Authorized Repair Center for maintenance.";

"FANFAILED_CPUBEX_MSG" = "The computer has detected a CPU B Exhaust Fan failure. Take your computer to an Apple Authorized Repair Center for maintenance.";

"FANFAILED_SLOT_MSG" = "The computer has detected a PCI Slot Fan failure. Take your computer to an Apple Authorized Repair Center for maintenance.";

"FANFAILED_DRIVEBAY_MSG" = "The computer has detected a Drive Bay Fan failure. Take your computer to an Apple Authorized Repair Center for maintenance.";

"FANFAILED_BACKSIDE_MSG" = "The computer has detected a Main Logic Board Backside Fan failure. Take your computer to an Apple Authorized Repair Center for maintenance.";

"FANFAILED_PS_MSG" = "The computer has detected a Power Supply Fan failure. Take your computer to an Apple Authorized Repair Center for maintenance.";

/* System sensor names */
"MAX6690LOC_U3AMBIENT"	= "Ambient Temperature Sensor Near U3";
"MAX6690RMT_U3DIODE"	= "U3 Diode Temperature Sensor";
"LM75_PCI"		= "PCI Slot Temperature Sensor";
"LM75_CPUAINLET"	= "CPU A Inlet Air Temperature Sensor";
"LM75_CPUBINLET"	= "CPU B Inlet Air Temperature Sensor";
"AD7417_CPUAAMB"	= "Processor Card A Ambient Temperature Sensor";
"AD7417AD1_CPUADIODE"	= "CPU A Die Temperature Sensor";
"AD7417AD2_CPUA12VCURR"	= "Processor Card A 12V Supply Current Sensor";
"AD7417AD3_CPUAVCORE"	= "CPU A Voltage Sensor";
"AD7417AD4_CPUACORECURR" = "CPU A Current Sensor";
"FAKE_POWER_CPUA"	= "CPU A Power Sensor";
"AD7417TEMP_CPUBAMB"	= "Processor Card B Ambient Temperature Sensor";
"AD7417AD1_CPUBDIODE"	= "CPU B Die Temperature Sensor";
"AD7417AD2_CPUB12VCURR"	= "Processor Card B 12V Supply Current Sensor";
"AD7417AD3_CPUBVCORE"	= "CPU B Voltage Sensor";
"AD7417AD4_CPUBCORECURR" = "CPU B Current Sensor";
"FAKE_POWER_CPUB"	= "CPU B Power Sensor";

/* System fan names */
"CPUA_INTAKE_FAN"	= "CPU A Intake Fan";
"CPUA_EXHAUST_FAN"	= "CPU A Exhaust Fan";
"CPUB_INTAKE_FAN"	= "CPU B Intake Fan";
"CPUB_EXHAUST_FAN"	= "CPU B Exhaust Fan";
"SLOT_FAN"			= "PCI Slot Fan";
"DRIVEBAY_FAN"		= "Drive Bay Fan";
"BACKSIDE_FAN"		= "Main Logic Board Backside Fan";
"PS_FAN"			= "Power Supply Fan";
